// Підключаємо технологію express для back-end сервера
const express = require('express')
// Cтворюємо роутер - місце, куди ми підключаємо ендпоїнти
const router = express.Router()

// ================================================================

// router.get Створює нам один ентпоїнт

//           ↙ тут вводимо шлях (PATH) до сторінки
router.get('/', function (req, res) {
  // res.render генерує нам HTML сторінку

  //            ↙ cюди вводимо назву файлу з сontainer
  res.render('index', {})
  //                  ↑↑ сюди вводимо JSON дані
})

// ================================================================

// router.get Створює нам один ентпоїнт

//           ↙ тут вводимо шлях (PATH) до сторінки
router.get('/cssLesson10', function (req, res) {
  // res.render генерує нам HTML сторінку

  //            ↙ cюди вводимо назву файлу з сontainer
  res.render('cssLesson10', {
    layout: 'cssLesson10',
    page: {
      title: 'CSS | Lesson10',
    },
  })
  //                  ↑↑ сюди вводимо JSON дані
})

// ================================================================

// router.get Створює нам один ентпоїнт

//           ↙ тут вводимо шлях (PATH) до сторінки
router.get('/cssLesson11', function (req, res) {
  // res.render генерує нам HTML сторінку

  //            ↙ cюди вводимо назву файлу з сontainer
  res.render('cssLesson11', {
    layout: 'cssLesson11',
    page: {
      title: 'CSS | Lesson11',
    },

    main: {
      content: [
        {
          name: 'Відображення',
          text: 'display — це CSS властивість, яка визначає відображення елемента на веб-сторінці',
        },
        {
          name: 'Зовнішній відступ',
          text: 'margin — це CSS властивість, яка задає зовнішні відступи елементу, відносно сусідніх елементів',
        },
        {
          name: 'Внутрішній відступ',
          text: 'padding — це CSS властивість, яка задає відступи від країв батьківського елементу (внутрішні відступи)',
        },
        {
          name: 'Назва',
          text: 'Пояснення',
        },
        {
          name: 'Назва',
          text: 'Пояснення',
        },
      ],
    },
  })
  //                  ↑↑ сюди вводимо JSON дані
})

// ================================================================

// router.get Створює нам один ентпоїнт

//           ↙ тут вводимо шлях (PATH) до сторінки
router.get('/cssLesson12', function (req, res) {
  // res.render генерує нам HTML сторінку

  //            ↙ cюди вводимо назву файлу з сontainer
  res.render('cssLesson12', {
    layout: 'cssLesson12',
    page: {
      title: 'CSS | Lesson12',
    },
  })
  //                  ↑↑ сюди вводимо JSON дані
})

// ================================================================

// Підключаємо роутер до бек-енду
module.exports = router
